# frozen_string_literal: true

brew 'mas'

# rubocop:disable Style/NumericLiterals
mas '1Password for Safari', id: 1569813296
mas 'JSONPeep',             id: 1458969831
mas 'Lungo',                id: 1263070803
mas 'Magic Lasso',          id: 1198047227
mas 'Parcel',               id: 639968404
mas 'Peek',                 id: 1554235898
mas 'Slack',                id: 803453959
mas 'StopTheMadness',       id: 1376402589
# rubocop:enable Style/NumericLiterals

tap 'mike-engel/jwt-cli'

brew 'argc'
brew 'atuin'
brew 'aws-sso-cli'
brew 'awscli'
brew 'bat'
brew 'choose-rust'
brew 'difftastic'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'fish'
brew 'flyctl'
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'glow'
brew 'gron'
brew 'gtop'
brew 'jj'
brew 'jq'
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'mise'
brew 'neovim'
brew 'overmind'
brew 'procs'
brew 'rga'
brew 'ripgrep'
brew 'starship'
brew 'television'
brew 'tmux'
brew 'tuc'
brew 'tz'
brew 'xsv'
brew 'zoxide'

cask '1password'
cask '1password-cli'
cask 'eloston-chromium'
cask 'firefox'
cask 'ghostty'
cask 'homerow'
cask 'orbstack'
cask 'postgres-unofficial'
cask 'raycast'
cask 'reflect'
cask 'session-manager-plugin'
cask 'setapp'
cask 'visual-studio-code'
cask 'zen'
