# frozen_string_literal: true

brew 'mas'

# rubocop:disable Style/NumericLiterals
mas '1Password',      id: 1333542190
mas 'Bear',           id: 1091189122
mas 'Fantastical',    id: 975937182
mas 'JSONPeep',       id: 1458969831
mas 'Lungo',          id: 1263070803
mas 'Magic Lasso',    id: 1198047227
# mas 'NotePlan 3',     id: 1505432629 # installed via Setapp
mas 'Parcel',         id: 639968404
mas 'Peek',           id: 1554235898
mas 'Slack',          id: 803453959
mas 'StopTheMadness', id: 1376402589
mas 'Tailscale',      id: 1475387142
# rubocop:enable Style/NumericLiterals

tap 'heroku/brew'
tap 'noahgorstein/tap'
tap 'synfinatic/aws-sso-cli'
tap 'tylerbrock/saw'

brew 'actionlint'
brew 'atuin'
brew 'aws-sso-cli'
brew 'awscli'
brew 'bat'
brew 'direnv'
brew 'dog'
brew 'dust'
brew 'elixir'
brew 'elixir-ls'
brew 'exa'
brew 'fd'
brew 'fish'
brew 'fisher'
brew 'flyctl'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'glow'
brew 'go'
brew 'gopls'
brew 'gtop'
brew 'heroku'
brew 'jq'
brew 'jqp'
brew 'kitty'
brew 'neovim'
brew 'oha'
brew 'overmind'
brew 'procs'
brew 'rbenv'
brew 'ripgrep'
brew 'rustup-init'
brew 'saw'
brew 'starship'
brew 'switchaudio-osx'
brew 'tealdeer'
brew 'tmux'
brew 'tuc'
brew 'tz'
brew 'xsv'
brew 'zoxide'

cask '1password-cli'
cask 'arq'
cask 'brave-browser'
cask 'firefox'
cask 'iterm2'
cask 'little-snitch'
cask 'mimestream'
cask 'postgres-unofficial'
cask 'raycast'
cask 'reflect'
cask 'session-manager-plugin'
cask 'setapp'
cask 'visual-studio-code'
cask 'zoom'
