jorgebucaran/nvm.fish
jorgebucaran/spark.fish
franciscolourenco/done
oh-my-fish/plugin-brew
oh-my-fish/plugin-tab
oh-my-fish/plugin-aws
oh-my-fish/plugin-pyenv
rbenv/fish-rbenv
jorgebucaran/autopair.fish
PatrickF1/fzf.fish
lilyball/nix-env.fish
z11i/github-copilot-cli.fish
